[
  {
    "header": "",
    "text": "Some history: I've been using Sennheiser's GAME ONE headsets since mid-2015. The audio quality is pretty much exactly what I want out of a headset, with a really good microphone (quality-wise) to boot. However, the GAME ONE has several downsides: creaky plastic / cheap build quality, cheap volume pot (knob) that eventually wears out (static, imbalanced audio, or both), 50 ohm impedance (onboard audio chipsets can only sometimes drive this), a mic that often requires a +10dB boost, and a high price tag. I've gone through four (4) GAME ONE headsets in 5 years due to the above reasons. Put another way: I definitely make use of the 2-year warranty.\n\nLast week I discovered the GSP 500s, watched a couple YouTube reviews, and was impressed: they looked like an improved version of the GAME ONE headset in several regards (better build quality, lower impedance, but possibly kept the same mic?). So I bought a pair. Here are my thoughts:\n\n* Build quality: better than GAME ONE. Sturdier, and while still made from plastic, it's thicker (and possibly a different type?) -- and I didn't experience any creaking (which drives me bonkers on the GAME ONEs -- it gets so loud at times its picked up by the mic!). The volume pot was significantly improved -- stiff, i.e. hard to turn (good!). But I did notice that turning the pot up/down at low volumes resulted in static (caused by either dust in the pot or something else), which worried me. The overall headphones themselves don't have the exact aesthetic that the GAME ONE and GAME ZERO have -- they look more \"gamer-y\" and stick out to the sides more -- but I can live with that.\n\n* Audio quality: a huge let down. To me, these sounded more like something between the GAME ZERO (which I feel has terrible drivers that sound flat and empty; focusing way too much on mid and highs) and the GAME ONE (but without its smooth \"punch\" or \"depth\" at lower frequenices). Specifically: the 80-600Hz frequency range on the GSP 500 was greatly lacking compared to the GAME ONEs. I had to use an EQ to increase these ranges (in a smooth \"hump\") to achieve the sound quality that the GAME ONE has. How noticeable is this difference? Very, especially with music. This is in contrast to all the YouTube reviews that say the GSP 500 is good for both gaming (I would agree partially there) and music listening (disagree). Finally, as for the volume levels -- because even YouTube reviews say the volume maxes out on the GSP 500 too early -- I agree with those reviews. My on-board audio can drive the GSP 500 no problem, but for older music mixed during days where compression was less of a thing, things were just too quiet. For a $200 gamer-focused headset from the same company to sound worse than its older counterpart was really, really disappointing.\n\n* Mic quality: the gain of the mic was substantially higher than the GAME ONE: no more +10 dB boost needed. And like the GAME ONE, no cross-talk (bleeding from output into mic) either. So far so good! However, the mic used in the GSP 500 *is not* the same mic as the GAME ONE in several ways. First, the GSP 500 mic picks up less bass in your voice, making you sound \"tinnier\" and further away. Secondly, the GSP 500 mic arm is shorter than the GAME ONE. Thirdly (and this was the deal breaker), the mic sensitivity is too high especially towards the high-end: it easily picks up mouse clicks of even quiet mice like the Logitech MX518! The mic is on your left side, so if you're a right-handed mouse user like most people, the GSP 500 mic will pick up every single mouse click. The GAME ONE doesn't have this problem due to having a longer arm (positioned more towards your mouth at the front yet still at an angle) and better frequency/noise filtering. The GSP 500 mic had a lot more noticable neutral/background hiss than that of the GAME ONE (the hiss was higher frequency, which meant they're using a different filter).\n\n* Miscellaneous: the GSP 500 uses the same break-out cord as the GAME ONE (i.e. proprietary), so if you already have a GAME ONE you can switch these cans out without having to fool around with wiring. The ear cup area was wider than the GAME ONE, so my ears actually felt less constrained. The headset tension against my head was not too much or too little, but I have an average-sized head. Finally, unlike one reviewer who (like me) shaves his head or is bald, I had no problems with the padding on the top of the headset or on the ears -- it was decent.\n\nBut as a result of the negatives -- especially the audio quality and mic issues -- I returned the product to Amazon for a full refund.\n\nI've said it before (in another review and in long-winded YouTube comments for the GAME ONE and GAME ZEROs) and I'll say it again: Sennheiser needs to take the drivers, the mic, and \"EQ circuitry\" (resistor series or whatever is used) from the GAME ONE and do the following: lower the impedence (from 50 ohm to ~35 ohm) so that more chips can drive them (and do the same for the mic! It's too quiet!), greatly improve the headset build quality while keeping the GAME ONE/GAME ZERO aesthetic, and increase the size of the ear cup area slightly (maybe 5-8mm in diameter) for more comfort. If they did that, they'd have a gaming headset that easily be worth $200 and blow competition out of the water. Sennheiser, if you want to talk, you know where to find me."
  },
  {
    "header": "",
    "text": "I purchased both HD 660s and GSP 500 to compare for purposes of PC Gaming: tldr: HD660s\n\nIf you are shopping open backed headphones, you are most likely gaming from a closed, quiet, man cave like space or office.\nA word of caution regarding sponsored SteelSeries Arctis - make sure to research these outside of amazon... nuff on that.\n\nInitial impressions: I used lossless music for initial testing and then went in game. I appreciate, and love good sound but by no means an audiophile. For some reason one of my bigger hang ups was getting past the marketing of surround headphones. I learned that your sound card, windows, ect, will turn any headphone into surround should you choose, there is no need to buy a USB surround branded (marketed) headset for this.\n\nThe GSP500 do sound wonderful, in fact they sound awesome. Without having anything to compare them too, I would have kept them because they do sound fantastic. However, between these and the HD660s it's a more difficult choice. I won't say it's a dramatic, but the difference is great enough to warrant spending the extra coin on the 660s, IF you will use your headsets for music, and desire a wider more accurate stage. It is pretty pronounced. Obviously the HD660s have to be used with a separate desktop mic.\n\nThe GSP500 are a little more punchy, they seem to have a bias that is a little deeper, and lose some small details in the mids. An example, on the HD660s I could pick out the sound of a guitar note being plucked from the string, vs just hearing the guitar note on a particular acoustic song during the test. The most dramatic difference between them, was how wide the sound stage is on the HD660s. This could be attributed to the fully open design on the 660 verses the open port on the GSP500. The GSP500 sound wide, wider than a closed back set by a lot. This REALLY helps with positioning and range. The HD660 I found to be a little more accurate on positioning. The partially closed feature of the GSP does control some bleed out of audio leaving the cups. It also insulates from outside noise slightly more than the HD660s, while still maintaining open back feel and comfort. For gaming this might be the perfect balance. The GSP500s are 28 ohm, while the HD660s are 150 ohm. Remember to adjust your sound card for the difference in ohms. Mine had a selector.\n\nMy cap size is 7 5/8\", the GSP500 were comfortable, after some time the ear cups seemed to mold into place. No problem wearing them for 6 hours. The adjustable tension on the GSPs is really smart. The headband is a little bulkier on the GSP, I did ultimately find the HD660 to be more comfortable, lighter, less bulky all around. The GSP 500 offered a much nicer wire, its cloth wrapped, easily manageable, tangle and catch free, it's perfect. The little machined fittings on the GSP are a great touch, where the wire plugs in and on the ear cups, it has a machined, masculine, quality feel and look. They really feel and look like a quality set, because they are.\n\nI don't think any headset will recreate properly set up and adjusted 5.1 speakers in terms of surround positioning. However, the quality of the audio itself is 10x better than my (low end by comparison z906) surround speakers, that goes for BOTH the GSP500 and the HD660s.\n\nMic quality on the GSP 500 had a noise canceling effect to it, which lessened some of the range of my voice as it transmitted. The blue yeti usb wins here. The GSP500 mic is very forgiving to background noises and does a good job noise canceling at the expense of some voice range. A desktop mic like the yeti, is going to give you added range but you need to stay on top of background noise because it's going to pick up everything. If you are shopping open back headsets though, you're prob already in a pretty quiet environment.\n\nBottom line, if you can afford the HD660s, appreciate a little extra detail in sound, a wider stage, will listen to music, go for HD660s. If not, I believe the GSP500 sound 85%-90% as good as the HD660, include a great mic, for half the price, that is a TON of value.\n\nSpecs: Win10, z170 i7 6700k, sound card: creative AE-5 used as direct sound to headphones, mic Blue Yeti usb"
  },
  {
    "header": "",
    "text": "Turns out that some USB sound cards can't work with this MIC. I tried the Sabrent card: https://www.amazon.com/gp/product/B00IRVQ0F8/ and the MIC didn't work. I eventually got a Soundblaster USB sound card and use this headset with it and it's great.\n\nI have the game audio piped through the speakers, and voicechat into the headphones and it works good."
  },
  {
    "header": "",
    "text": "It’s a solid gaming headset. I wanted quality and I got it. Never buy a cheap headset when the ps5 is $600 or more. You will not be sorry with this headset. Having the master control on your head is great for hearing sounds and before shooting, lowering the volume and turning back up after the shot.\nJust buy it already."
  },
  {
    "header": "",
    "text": "Went from the Game 0s to this after trying a few others out. Sound quality is great, amazing. No qualms about that ever, noise ancellation is ok but thats fine because its open backed. My only problem is that the ear cups are kinda stiff, thought theyd break in after a bit but doesnt seem like they will. The razer blackshark is probably the most comfortable but it wont compare to the sound quality of this headset. The cups arent too uncomfortable that going on 3 hours of gaming causes any problems, just wish they were a little softer."
  }
]