[
  {
    "header": "",
    "text": "I was browsing for a new chair and I wanted something to match the aesthetic of my office currently. I'm a young college student so these racing style chairs appeal to me. The stark black and blue leather really drew my eye considering my whole set-up is black and blue. I'm a video editor as well as gaming for my hobby, so I'm at the computer a lot and my old $60 chair just wasn't cutting it anymore. I saw this chair was #1 Best Seller, had multiple good reviews not only on Amazon but on other websites as well, so I ordered it. I'll outline some feature of the chair below if interested.\n\nSetup:\nI got the package and everything was rather simple to put together the hex bolts were a little bit bigger than any Alan key I had so I had to use the small included Alan key but you can use a normal screw driver for the screws. The design is a little flawed and it some parts jam up the Alan key only allowing you to do 180 turns rather than 360, taking a little longer than necessary. Some of the fabric bits around the holes covers up and is really stubborn to move out of the way, hold the piece, and screw all at the same time. So I resorted to breaking at a hobby knife and just removing some fabric around the holes myself (it will be covered up 100% with the part).When I was done it looked and felt sturdy. The first time I used the reclining feature it made a loud snap but nothing broke. The wheels make it a little hard to roll, they are this soft plastic/rubbery texture and I guess that is nice for not scratching or drifting around but you won't be able to slide around your office that smoothly or easily.\n\nBack Support:\nProbably the best part about this chair is I can sit a lot of different ways and my back always feels wonderful. Whether I'm upright, leaning forward, or reclining their is always adjustments I can do to the pillows and reclining mechanism to support my back. I don't have knots in my back a lot anymore or those really tender spots you have to ask your significant other to work out or using a heating pad for. However sitting in it for the first time wasn't as joyous experience I was expecting.\n\nSeat Support/First Time Sitting in it:\nFrom the pictures it looked like the seat was going to be the best part with all those different sized/angled cushions. I thought my butt was going to have a nice break from my cheap worn out chair and have support from multiple different directions, not true. While it did feel better on the butt (than my cheaper chair) it killed my thighs. See, the two little side cushions on the left and right underneath the arm rest aren't really cushions...it just a cover for two metal beams on either side wrapped in some foam. Sitting how you normally would in a chair will kill your thighs and make them go to sleep. I couldn't sit normally for the first day and decided to just try laying back in the chair in the recliner mode and watch some videos. The recliner mode is very comforting (I almost fell asleep) and very stable, I never feel like I'm going to fall even while the back is angled backwards and I'm leaning back with my feet up. The next day I needed to get a bunch of editing work done so I needed to find a solution and way to break in the chair fast. My dudes, their is no room for spreading your legs if you know what I mean...so sitting normal was a little uncomfortable...I tried moving my butt forward some and putting my shoulders back further and that helped but after a while those metal bars just started digging into the side of my legs again. I needed a damn solution because I just thought no computer chair I ever buy is going to be perfect, no point in returning this one, just find a solution...I put an old Serta memory foam pillow down and that helped but my weight made it shrink over time and the metal bars came back digging into me. I added a folded up small blanket on top of that and it helped with some cushioning but I couldn't get both items to line up perfectly with the back so the back of my butt was sliding down into the crack and pushing everything toward the front and off the chair regularly. I moved the small pillow that was meant for the lower back support and slid it down into the crack but it didn't feel right and my lower back wasn't getting the support that I loved when I originally sat down in it. So I found a small square couch pillow and used that instead. Finally, everything was set...I couldn't feel those harsh metal bars sticking into my legs, I had a nice little booster seat, and the back rest felt amazing on my always sore back. I edited all day trying to get as much as I could done before my tailbone started hurting (has happened on every chair I've owned). I did this for the next 3 days and then decided that it had to be somewhat broken in now and I should try it out. I found a comfortable sitting position with my butt a little forward on the seat and shoulders back a bit. The neck pillow is right below my hairline and the back support pillow is at about the middle of my back. The seat cushions allow me to sit for longer periods of time without having to get up and walk around as much (even though I probably should). Then when I want to kick my feet up and watch some videos I can do that with this chair too.\n\nComplaints/Conclusion:\nThe arm rests are already a little loose and jiggly but they are pretty useless unless at a small desk, the height of the chair isn't that great (it's very low to the ground at it's highest setting), the side cushions aren't actually cushions and just their aesthetically, I think filling those with cushioning and upping the price some would make this chair a 5-star product for me."
  },
  {
    "header": "",
    "text": "Edit#3: Finally assembled the replacement chair, found a few things that still make me unhappy with this chair. Customer support was great for getting everything set up. They sent me a replacement and gave me a full refund. I'm still not 100% happy with the assembled chair, it's just not quite as comfortable as the old office chair I had.\n\nThis chair came packaged well, though there was a hole punched through the side of one of the inner boxes which was clearly damaged, all of the parts were intact without any major damage beyond the same/similar scuffs to the metal and chair that the last one.\n\nThe chair itself is worth only a 3 or 4 star review, I'm not impressed and I have had better chairs for a little less - however, customer service was top notch and got everything taken care of above and beyond what I expected.\n\nPros:\n*Customer service responded very quickly. They replaced the defective chair relatively quickly. I had my replacement within about 2 weeks between sending pictures of the chair to CS and getting the replacement sent to me.\n* I was able to assemble the replacement without any major issues.\n* The lumbar support and had rest are optional.\n\nCons:\n*Chair is a little stiff/hard.\n*Designed for someone with a larger frame. I'm 5'3\" and the proportions feel off like the seat back and seat are designed for someone taller, yet the arm rests sit low so they're unusable for me.\n*The chair smells heavily of chemicals. I don't have anywhere to let it just sit to air out so I've cut AC for now and cracked windows to try airing the chemical smell out of the room.\n*The parts are still miss-labeled vs what actually comes in the box for this item. You have to go by image and/or watching their video for instruction (I didn't bother with the video, I had practice with parts on it with my first defective chair from them and other chairs I've assembled).\n\nEdit #2: I just got the replacement chair today, looking like the holes are drilled in the correct locations this time and I may actually be able to assemble the chair. As before the instructions are only worth using as kindling and not going to be of much use for putting the chair together as parts and part numbers/letters don't match up so I'm guessing a bit still. I did upgrade my review to a 2 star as things appear to fit together!\n\nHowever, I am still waiting for the refund I was promised in a prior contact. The seller stated that they would give me both refund and replacement. I am waiting for contact back from the seller to see if this will actually happen. If it does I may upgrade my review again. Customer service so far has been very responsive though I was asked multiple times for photos - even though I sent them 18 different photos of all of the damages and differences between the product numbering and the instructions. As well as photos of the minor cosmetic damages both to the leather and the metal/plastic on the chair.\n\nEdit #1:\nContacted the seller to return for a replacement initially, then changed my mind that I would prefer to have a full refund/return rather than keeping this item and indicated as much when I contacted them by email again. I did not want to risk getting another one and having the same/similar issues given other low reviews I read.\n\nI have been contacted by the seller and they are offering me a replacement & refund. I will be editing my review when I get the replacement chair. So far they are very willing to work with me.\n\nInitial review:\nThis product arrived earlier than expected, however I immediately had multiple issues with this item.\n\nFirst, I do tend to use instructions to verify all parts/pieces are there when I get an order. On checking all items/pieces in the box vs the instructions this came with each of the items are labeled different from their instruction booklet. Not a big deal but it does mean you're matching piece to picture rather than being able to use their system to verify all the parts are there.\n\nNote the parts labeled '6' and '2' are labeled L1 and L2 in the book. R1, L4 and R3 are similarly non-existent for numbering/labeling in the instructions vs the product I actually received. Pictures attached of the miss labeled items too - it's printed on each item and there were not any of the little stickers or labels on bags which even corrected or contradicted the labeling printed on the items.\n\nThe next issue I had is I noticed a lot of small superficial damages to the metal on the chair and minor scrapes to the leather on the back of the seat. As I was inspecting the seat I noted one of the sides where the screws would go in for attaching the side had some damage around it/the leather. Again, something I thought was cosmetic more than anything else.\n\nWhen I attempted to assemble this I stopped about half way through - I found the holes for the screws on the seat on both sides are spaced too far apart making it impossible for me to attach the back of the chair to the seat. I also tried flipping the part around to see if I was attaching it incorrectly, still about a half inch difference between where the screws should have been and where they were. You can see in my images that're attached where the damage on the chair where the holes were incorrectly drilled.\n\nContacted the seller to return for a replacement initially, then changed my mind that I would prefer to have a full refund/return rather than keeping this item and indicated as much when I contacted them by email again. I did not want to risk getting another one and having the same/similar issues given other low reviews I read.\n\n*Edit - I have been contacted by the seller and they are offering me a replacement & refund. I will be editing my review when I get the replacement chair. So far they are very willing to work with me."
  },
  {
    "header": "",
    "text": "Listen.\n\nIf you want a comfortable, super long lasting chair with good back support simply do not buy a gaming chair. They are not designed to be ergonomic. They are not designed for office work or even long hours of gaming, really. They are designed for one thing and one thing only, and that thing is to Look Fun.\n\nMega-comfy office chairs just don't exist in fun colours! Black and grey is so boring!! This chair consistently makes me a little bit happier every time I walk into my room because haha bright pink. The neck and lumbar pillows? Fun, but useless. The cushion? Could absolutely be cushier. Have I regretting spending so much money on it yet? Nope!\n\nPeople complain about these being hard to build too, which on one hand is fair because the instructions are very vague, but I built this sucker by myself in an hour three days after major abdominal surgery, so I think you'll be fine."
  },
  {
    "header": "",
    "text": "I weight 175lb, The max stated weight is 300 lb. The Gas lift simply gradually falls to the ground after 5 months of week day usage just like sub $100 chairs. I have messaged the supplier asking for a new gas lift and will update my review accordingly."
  },
  {
    "header": "",
    "text": "Si bien es cierto la silla es de una muy buena calidad, después de un tiempo el colchón dentro de la silla sede con el peso, sin embargo, esto no es nada para preocuparse, ya que al dejar de utilizarla vuelve a su estado original, hay que mencionar que en ningún momento la silla pierde la comodidad. "
  },
  {
    "header": "",
    "text": "Es muy buena silla pero un poco overpriced, si no les importa gastar un poco de más esta excelente. Si la llegan a ver en descuento sería una compra perfecta. "
  },
  {
    "header": "",
    "text": "Relación calidad / precio bastante malo. Por su precio, se esperaría que los reposa brazos tuvieran acolchado y se pudieran acomodar. Valdría la pena por 5000 o menos. "
  }
]