[
  {
    "header": "",
    "text": "I've been using Hyper X headsets since 2014ish and have always been a fan of the comfort and performance for the price. I just replaced my cloud alpha wireless with this one due to wired preferences and I am really enjoying them. Super comfortable and well built. Doesnt feel cheap. The sound quality is maybe.. a smidge worse than the cloud alpha, but its also half the cost. I can't complain. There's definitely a good range, especially for a gaming headset for 100$. The usb C alongside an included usb A adapter is also a plus. The mic isnt as good as a stand alone mic or anything, but its definitely serviceable. Would highly recommend unless you absolutely need top of the line audio quality."
  },
  {
    "header": "",
    "text": "I was expecting a upgrade or at least same quality as the hyperx cloud 2. I was wrong. The cloud 2s are much better in my opinion. The sounds are not as good. The sounds direct for footsteps aren't as good. The mic quality isn't as good either. I did a test on a chat party asking which mic sounded the best without any bias and everyone chose the 2s. Disappointing to say the least."
  },
  {
    "header": "",
    "text": "  These headphones are built ice and can take quite a beating. I was hoping listening to music on them would sound alright but these are not for that at all. It only does kicks and high notes. Low sounds and bass almost don't exist with these. Overall, I will be keeping these because I feel like they will be decent to game on and will hopefully last a long time due to the metal frame."
  },
  {
    "header": "",
    "text": "Looks cleaner than the Hyper X 2 and the packaging is amazing looks like they truly care about the customer. Everything is intact and I'm having zero issues with them. Plus the colors and simple sleek design is muy bueno, matches my controller perfect, also you just can't best the price for the quality. Two big thumbs up and absolutely 5 stars. Thank you Hyper X Team!"
  },
  {
    "header": "",
    "text": "The sound quality sounds worse with less bass than cloud 2.\n\nThis headset doesn’t come with cloth ear pads, it’s literally 90 degrees in July and you are stuck with these awful faux leather pads.\n\nThis is an over the ear headset, but they removed the foam padding from the cloud 2 that makes a barrier between the plastic speaker and your ear, so they are extremely painful having a textured plastic piece pushing against your ear.\n\nThey are more expensive than cloud 2, come with less ear pads, sound worse, less comfortable."
  },
  {
    "header": "",
    "text": "I got these to compare against my Astro A40s and Sennheiser PC38X headsets.\n\nPros:\n- Very lightweight yet good construction. Anodized aluminum arms. Textured plastic ear cups. THICC memory foam headband and ear cushions\n- Very comfortable. Lightweight. DEEP ear cushions. I can wear glasses at the same time no problem\n- Sound stage close/far is good. More on this later.\n- Comes with 3.5mm to USBA/C adapter. Very nice! Love this. My desktop doesn't have a 3.5mm combo jack so this is what I used for testing\n- Cable is braided rubber and very nicely made\n- Detachable cable and mic\n- Microphone is nice! I like that it's a bit shorter. Encourages placement at the corner of the mouth rather than in front, which reduces plosives.\n- Mic quality is good for a headset. Better than my Sennheiser PC38X. Perhaps a little gritty, but very clear\n- VERY detailed audio quality. More later.\n\nNeutral:\n- Sound isolation is just OK. My V-Moda M100s are better\n- Volume control works well, no distortion, but doesn't have any noticeable detents\n- Headphone adjustment detents aren't very noticeable\n\nNegative:\n- Sound quality is detailed but harsh. Upper mids seem to be VERY forward.\n- Sound quality for gaming: For hardcore FPS shooters, this means gunshots and spoken words are very apparent. Good if you're hardcore. BUT it's also incredibly fatiguing. Bass-heavy sounds (tanks driving around, explosions) and low-mids (footsteps) are detailed, but have this \"distance\" to them. Everything feels farther away compared to my PC38X and A40s. After playing for an hour, I got used to the harshness and actually liked how detailed everything was. These might be pretty good for hardcore shooters. HOWEVER, where they fall flat is in left/right directional audio. Close/far these are very good at, better than my PC38X. But it overshadows left/right clarity somehow.\n- Sound quality for music: Again, with the very forward upper mids, vocals are incredibly clear and detailed, to a point of fatigue. Treble such as symbol crashes are again quite detailed, and are more forward but not as much as upper mids. Lower mids are somewhat forward. Lows are tight and crisp but lack depth. They sound far away and feel short-lived.\n\nSo overall, these are good headphones. The sound quality criticism I have is me being VERY critical and comparing these to headphones which cost more. These are INCREDIBLY detailed. Instrument separation is better than my PC38X, these are SUPER comfortable and lightweight, and included a USB adapter. However, the soundstage is a mixed bag. In shooters, it feels like your character is in an indoor shooting range: you can hear your gun very well, but it feels two-dimensional. For $100, these are a good buy, but I'll be sticking with my less fatiguing PC38X even though they're not as detailed, nor as comfortable.\n\nI'm going to let music play through these for a couple days straight to get ~30 - 50 hours of burn-in. I'll update this review if my opinion changes. Hope this helps!"
  },
  {
    "header": "",
    "text": "this headset is quite possibly the best option for me it's under $110 it connects easily without much tech know-how needed and it's better than any other brand at the same price range I've tried, which includes Corshair, Turtle Beach, RAZR, and Logitech."
  }
]