[
  {
    "header": "",
    "text": "These fit on my corsair void headphones, great replacement and my cat chewed of the leather on the other ones"
  },
  {
    "header": "",
    "text": "The stock ones had that cheap vinyl coating that ended up starting to peel off after heavy use, these are cloth and not as hot feeling as the stock ones."
  },
  {
    "header": "",
    "text": "I've been pretty annoyed with the lack of quality of Amazon products lately, but... I know this is hard to tell, because I've had my original pads for so long they fell apart at the seams. But after some cursing and a struggle to put these on, my headphones actually sounded better. I had to turn my volume down from 22 (which I usually keep it at) to 18. So that tells me these have good noise cancelling, at least.\n\nIs a tight fit a bad thing or a good thing? They might not come off so easily which is great. I don't think I'll have a good time taking these off to clean them, so keep that in mind. Anyway, I'm happy that they sound better than my old raggedy Corsair ones."
  },
  {
    "header": "",
    "text": "Too expensive. Normal quality"
  },
  {
    "header": "",
    "text": "great quality"
  },
  {
    "header": "",
    "text": "The material is far worse than the original earcups. It's smoother so it slides around on your head more, and it's not as soft, which means as it slides it makes noise. Maybe they'll break in over time but for now I feel like I would have rather just replaced the entire headset."
  },
  {
    "header": "",
    "text": "These work just fine once you wrestle them onto the headphones. My originals were starting to come apart after a few years, hopefully these will last as long. I wish they made them in leather."
  },
  {
    "header": "",
    "text": "Not only did I think I was going to tear them, and then they finally went on. Expect to fight with them to get them on. Once on, however, I have the feeling the headset will die before they come off."
  },
  {
    "header": "",
    "text": "Perfect fit to HyperX."
  },
  {
    "header": "",
    "text": "Perfect, sound isolation. Child happy 😊"
  },
  {
    "header": "",
    "text": "Smaller than the original ones although it is mentioned they fit. Emailed them to collect as i want a refund and never heard of them."
  },
  {
    "header": "",
    "text": "Does not fit the HyperX Cloud Alpha headseat as it says it does"
  }
]