[
  {
    "header": "",
    "text": "I LOVE this band and I am NOT a fitness band person. Its the most comfortable and accurate and thorough band I have ever had (I only had 3). I dont care there is no watch face which alot of people care about. I am not interested in a watch. The ONLY con is the cheap plastic U piece that folds over and holds the band in place. WHY? It has come undone and nearly broke a few times. I HATE that. There is no reason for it to be SO flimsy on an otherwise outstanding piece of technology! I am worried I will snap it or break it at some point accidentally. Even snapping on the charger got a little difficult because it was slightly bent out of shape, which makes it fall out the hinge/holes. Otherwise, it would be 5 stars!"
  },
  {
    "header": "",
    "text": "Got whoop today and logged in set up and only 6 months membership. Will ask customer support tomorrow. A little disappointed as it says 12 months here. Not sure why.\n\nUpdate after reaching out they fixed and am very happy with it so far"
  },
  {
    "header": "",
    "text": "this i have found is much more for sleep and recovery tracking for me . the new weight training dose work well for ppl that dont run really so it is getting even better but the best things are the sleep tracking it will keep you honest if you care about that stuff and the recovery score seems to line up with how i feel most days for what ever thats werth ... just rember this comes with 1 year after that you will need to pay a sub that can be as much as 30 bucks a month so keep that in mind!!!! and be carfull when i set up mine it only gave me 6 month free but after contackting them by text in the ap and texting a pic of the add were it said a year and they fixed it in like 2 minets it would have been better for it not to happen but they fixed it fast . but make sure you look."
  },
  {
    "header": "",
    "text": "This doesn't work with all Android 13 devices. Do yourself a favor and check first - there are many phones that are having pairing issues and won't work. Unclear if it's the fault of Whoop or the phone manufacturers, but seems like the latter, since some DO work (Pixel 7 reportedly is fine, as are Galaxy devices).\n\nThat aside the HR accuracy seemed very questionable for me - at times reading too high, when compared to my running watch and HR strap I use with treadmill. So based on both of these issues I returned it."
  },
  {
    "header": "",
    "text": "Wasn’t sure how I would like this. It is great super easy to use and set up I never take it off. Highly recommend. Lots of information still learning it all."
  },
  {
    "header": "",
    "text": "My husband does jiu jitsu and Whoop has been great product for measure his strain, sleep, and recovery. He also has a Apple Watch but it does not go into as much depth as Whoop. Whoop also shoes things like impact of drinking alcohol which is really neat!"
  },
  {
    "header": "",
    "text": "It provides tons of data which may or may not be correct.\n\nI believe listening to one’s body is likely more impactful than a phone app and HR sensor, which its advice mostly boils down to “get more sleep, avoid alcohol, use blue light blocking glasses, and don’t eat large meals before bed.”\n\nIf you feel a fitness tracker is a must, check out a Garmin watch or Apple Watch. It’s one a time fee and provides identical statistics, minus the subscription. Whoop has a ways to go before they can justify a yearly fee of $240"
  },
  {
    "header": "",
    "text": "It makes more aware of things you should be doing. Helps you to see where you need to make adjustments to help build you a better healthy life style.\nThis does not count steps, this is for the real people who want to make a change in their health.\nYou'll get roughly three days of power in constant use."
  },
  {
    "header": "",
    "text": "El producto llegó a tiempo y bien empacado, sin embargo una semana después de que llegó dejó de funcionar.\nAun cargado de pila no enciende "
  },
  {
    "header": "",
    "text": "Charging an issue! Owned for 2 weeks now and today it has refused to charge even though battery pack full. Device completely dead. Frustrating"
  },
  {
    "header": "",
    "text": "I was excited to see whoop on Amazon so decided to buy the product.\n\nIt arrived next day but when I registered the device I only got 6 months subscription not the advertised 12.\n\nWhoop chat couldnt email, so they sent me to email support. They said they’d added the additional months, but they haven’t. Now I’m being ghosted.\n\nAmazon unfortunately don’t want to help either. Offering a refund or replacement which doesn’t solve my problem because I’d end up with another band and another 6 month subscription. I want the 12 months I’ve paid for."
  },
  {
    "header": "",
    "text": "On activating the band it doesn’t give you 12 months membership, just 6. Customer service is horrendously poor and shipped from pillar to post. Far from impressive start to a customer relationship"
  },
  {
    "header": "",
    "text": "On the whole this is a brilliant device with a very in depth app to accompany it. My issue is since purchasing this with what was sold as a ‘12 month membership’, after setting the account up it only shows for 6 months. I’ve sent countless messages to them via live chat and been told it’s being dealt with, heard nothing yet. I’ll update as soon as I do."
  }
]